app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations"
---
        def index
          conversations = Conversation.all

INSERT INTO "conversations" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hello"], ["created_at", "2019-01-31 12:05:24.960085"], ["updated_at", "2019-01-31 12:05:24.960085"]]
---
        def create
          conversation = Conversation.new(conversation_params)
          if conversation.save