app/controllers/reviews_controller.rb

UPDATE "reviews" SET "comment" = $1, "updated_at" = $2 WHERE "reviews"."id" = $3
---
    def update
        @review.update_attributes(review_params)